import React from "react";

export interface ISlide {
    id: number
    logo: React.ReactNode
    title: string
    description?: string

}

export interface IPagination {
    svg: React.ReactNode
    active: React.ReactNode

}

export const sliders: ISlide[] = [
    {
        id: 1,
        title: 'Анализ текущего состояния карьеры',
        logo: <svg width="81" height="80" viewBox="0 0 81 80" fill="none" xmlns="http://www.w3.org/2000/svg" >
            <path fillRule="evenodd" clipRule="evenodd" d="M37.2017 0C36.9867 0 36.8125 0.174239 36.8125 0.389175V6.41016C36.8059 6.41016 36.7993 6.41016 36.7927 6.41016C16.4727 6.41016 0 22.8842 0 43.206C0 63.5278 16.4727 80.0019 36.7927 80.0019C57.1124 80.0019 73.5848 63.5285 73.5855 43.2073H79.6216C79.8366 43.2073 80.0109 43.0329 80.0109 42.8179C80.0109 19.175 60.8446 0 37.2017 0ZM55.1891 43.2073H73.5855C73.5855 43.2068 73.5855 43.2064 73.5855 43.206C73.5855 22.8908 57.1235 6.42084 36.8125 6.41016V24.8081C36.8059 24.8081 36.7993 24.8081 36.7927 24.8081C26.6327 24.8081 18.3964 33.0451 18.3964 43.206C18.3964 53.3669 26.6327 61.604 36.7927 61.604C46.9524 61.604 55.1884 53.3676 55.1891 43.2073ZM55.1891 43.2073H37.8125C37.2602 43.2073 36.8125 42.7595 36.8125 42.2073V24.8081C46.9635 24.8188 55.1891 33.0517 55.1891 43.206C55.1891 43.2064 55.1891 43.2068 55.1891 43.2073Z" fill="#A59DFF" />
        </svg>,
        description: 'Проведем оценку вашего кейса и создадим стратегию для дальнейшего карьерногоразвития.'
    },

    {
        id: 2,
        logo: <svg width="80" height="80" viewBox="0 0 80 80" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fillRule="evenodd" clipRule="evenodd" d="M3.58925e-05 18.5182C3.59195e-05 18.2093 0.25099 17.9588 0.55995 17.9588C6.58202 17.9588 12.4036 18.8246 17.9063 20.4385L17.9063 62.0408L59.5946 62.0408C61.2223 67.558 62.0959 73.3977 62.0959 79.4411C62.0959 79.7498 61.8457 80 61.537 80L1.00003 80C0.447746 80 3.05567e-05 79.5523 3.0605e-05 79L3.58925e-05 18.5182ZM59.5946 62.0408L80.0024 62.0408L80.0024 -0.000106812L17.9063 -0.00011224L17.9063 20.4385C37.9087 26.3051 53.6986 42.0567 59.5946 62.0408Z" fill="#A59DFF" />
        </svg>,
        title: 'Сопроводительные письма и резюме',
        description: 'Поможем сформировать профессиональныйпортфель, которые выделит вас среди других кандидатов.'
    },
    {
        id: 3,
        logo: <svg width="80" height="80" viewBox="0 0 80 80" fill="none" xmlns="http://www.w3.org/2000/svg" >
            <path fillRule="evenodd" clipRule="evenodd" d="M0 80L-1.74845e-06 40L11 40L11 69L40 69L40 80L0 80ZM40 58L40 69L51 69L51 58L80 58L80 -3.49691e-06L22 -9.61651e-07L22 29L11 29L11 40L22 40L22 58L40 58ZM22 40L40 40L40 58L51 58L51 29L22 29L22 40Z" fill="#A59DFF" />
        </svg>,
        title: 'Поиск работы',
        description: 'Определим вашу карьерную цель и разработаем стратегию для трудоустройства.'
    },
    {
        id: 4,
        logo: <svg width="80" height="80" viewBox="0 0 80 80" fill="none" xmlns="http://www.w3.org/2000/svg" >
            <path fillRule="evenodd" clipRule="evenodd" d="M47.3251 39.9592C47.3251 53.0277 36.731 63.6218 23.6625 63.6218C23.5653 63.6218 23.4681 63.6212 23.3711 63.62L23.3711 16.2984C23.4681 16.2973 23.5653 16.2967 23.6625 16.2967C36.731 16.2967 47.3251 26.8908 47.3251 39.9592ZM23.3711 16.2984C10.4369 16.4546 -2.31716e-06 26.9881 -1.75017e-06 39.9592C-1.18319e-06 52.9304 10.4369 63.4639 23.3711 63.62L23.3711 79.9985L39.999 79.9985C62.0901 79.9985 79.9984 62.0902 79.9984 39.9992C79.9984 17.9081 62.0901 -0.00018582 39.999 -0.000184854L23.3711 -0.000184127L23.3711 16.2984Z" fill="#A59DFF" />
        </svg>,
        title: 'Тренинг по презентации личного бренда',
        description: 'Подсветим сильные стороны и грамотно выстроим самопрезентацию'
    },
    {
        id: 5,
        logo: <svg width="80" height="80" viewBox="0 0 80 80" fill="none" xmlns="http://www.w3.org/2000/svg" >
            <path fillRule="evenodd" clipRule="evenodd" d="M47.3251 39.9592C47.3251 53.0277 36.731 63.6218 23.6625 63.6218C23.5653 63.6218 23.4681 63.6212 23.3711 63.62L23.3711 16.2984C23.4681 16.2973 23.5653 16.2967 23.6625 16.2967C36.731 16.2967 47.3251 26.8908 47.3251 39.9592ZM23.3711 16.2984C10.4369 16.4546 -2.31716e-06 26.9881 -1.75017e-06 39.9592C-1.18319e-06 52.9304 10.4369 63.4639 23.3711 63.62L23.3711 79.9985L39.999 79.9985C62.0901 79.9985 79.9984 62.0902 79.9984 39.9992C79.9984 17.9081 62.0901 -0.00018582 39.999 -0.000184854L23.3711 -0.000184127L23.3711 16.2984Z" fill="#A59DFF" />
        </svg>,
        title: 'Подготовка к собеседованию',
        description: 'Научим говорить о себе кратко,ярко и профессионально.'
    },
    {
        id: 6,
        logo: <svg width="70" height="80" viewBox="0 0 70 80" fill="none" xmlns="http://www.w3.org/2000/svg" >
            <path fillRule="evenodd" clipRule="evenodd" d="M43.1037 3.68501C29.4529 -3.98871 11.9118 0.709949 3.92468 14.1798C-4.06248 27.6496 0.528798 44.7898 14.1796 52.4635L18.5779 54.936L18.5779 80L41.8346 80C57.389 80 69.9985 67.3906 69.9985 51.8361C69.9985 41.2642 64.1735 32.0527 55.558 27.2361L62.9182 14.8237L43.1037 3.68501ZM55.558 27.2361C51.4975 24.9661 46.8171 23.6722 41.8346 23.6722L18.5779 23.6722L18.5779 54.936L33.9941 63.6021L55.558 27.2361Z" fill="#A59DFF" />
        </svg>,
        title: 'Рекомендация по базе STEMPS Career',
        description: 'Поможем встретиться соискателю и работодателю.'
    },
];

export const pagination: IPagination = {
    svg: <svg width="8" height="8" viewBox="0 0 8 8" fill="none" xmlns="http://www.w3.org/2000/svg">
        <circle cx="4" cy="4" r="4" fill="#CCCCCC" />
    </svg>,
    active: <svg width="40" height="8" viewBox="0 0 40 8" fill="none" xmlns="http://www.w3.org/2000/svg">
    <rect width="40" height="8" rx="4" fill="#CCCCCC"/>
    <rect width="20" height="8" rx="4" fill="#1C1C1C"/>
    </svg>
    
    
} 